IDEA Open Model
CheckResWeld Class
Compatible with IDEA StatiCa 20.1
 Check value for Weld
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CheckResWeld
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[SerializableAttribute]
public class CheckResWeld
<SerializableAttribute>
Public Class CheckResWeld
The CheckResWeld type exposes the following members.
Constructors
Name | Description
CheckResWeld
Initializes a new instance of the CheckResWeld class
Top
Properties
Name | Description
CheckStatus
 Status of the Check
Id
 Unique id of weld
Items
 In case of presentation of groups plates (uncoiled beams)
LoadCaseId
 Id of Load Case
Name
 Name of Weld
UnityCheck
 Unity Check Stress
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace